УТ_для_edt/src/Catalogs/смартОтчетПоГарантииМимаки/смартОтчетПоГарантииМимаки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартОтчетПоГарантииМимаки</name>
  <comment>//++ #1287 смарт: Фролов 13.03.2023 //Работа с гарантийными и коммерческими запасными частями</comment>
  <attributes>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроблемы</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.смартЗаявкаНаГарантийныйРемонт</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаПоломки</name>
    <type>
      <types>EnumRef.смартПричиныПоломки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредметПоломки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеУстраненияПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФотоОборудования</name>
    <type>
      <types>CatalogRef.смартЗаявкаНаГарантийныйРемонтПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФотоШильдаОборудования</name>
    <type>
      <types>CatalogRef.смартЗаявкаНаГарантийныйРемонтПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ParametersДоИнсталяции</name>
    <type>
      <types>CatalogRef.смартЗаявкаНаГарантийныйРемонтПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>LogДоИнсталяции</name>
    <type>
      <types>CatalogRef.смартЗаявкаНаГарантийныйРемонтПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>LogПослеИнсталяции</name>
    <type>
      <types>CatalogRef.смартЗаявкаНаГарантийныйРемонтПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ParametersПослеИнсталяции</name>
    <type>
      <types>CatalogRef.смартЗаявкаНаГарантийныйРемонтПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Чернила</name>
    <attributes>
      <name>Чернила</name>
      <type>
        <types>CatalogRef.смартОборудованиеКлиентов</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЛота</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>35</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Enums/смартПричиныПоломки/смартПричиныПоломки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартПричиныПоломки</name>
  <comment>//++ #1287 смарт: Фролов 14.03.2023 //Работа с гарантийными и коммерческими запасными частями</comment>
  <enumValues>
    <name>MissingItems</name>
  </enumValues>
  <enumValues>
    <name>ErrorWarning</name>
  </enumValues>
  <enumValues>
    <name>HeadNozzle</name>
  </enumValues>
  <enumValues>
    <name>PrintQuality</name>
  </enumValues>
  <enumValues>
    <name>Mechanical</name>
  </enumValues>
  <enumValues>
    <name>Other</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/смартОтчетПоГарантииМимаки/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура СерияПриИзмененииНаСервере()
	Запрос=Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                    |	ПриобретениеТоваровУслугТовары.Номенклатура КАК Номенклатура
	                    |ИЗ
	                    |	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
	                    |ГДЕ
	                    |	ПриобретениеТоваровУслугТовары.Серия = &Серия
	                    |	И ПриобретениеТоваровУслугТовары.Ссылка.Проведен");
	Запрос.УстановитьПараметр("Серия",Объект.Серия);
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Объект.Оборудование=Выборка.Номенклатура;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СерияПриИзменении(Элемент)
	СерияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Запрос=Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		                    |	смартОтчетПоГарантииМимаки.Ссылка КАК Ссылка
		                    |ИЗ
		                    |	Справочник.смартОтчетПоГарантииМимаки КАК смартОтчетПоГарантииМимаки
		                    |ГДЕ
		                    |	смартОтчетПоГарантииМимаки.ДокументОснование = &ДокументОснование
		                    |	И НЕ смартОтчетПоГарантииМимаки.ПометкаУдаления"); 
		Запрос.УстановитьПараметр("ДокументОснование",Объект.ДокументОснование);
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() ТОгда                                     
			Сообщить("По данному документу отчет уже существует, найтите отчет в связанных документах"); 
			Стандартнаяобработка=Ложь;
			Отказ=Истина;
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	Если Объект.ПричинаПоломки=Перечисления.смартПричиныПоломки.HeadNozzle 
		ИЛИ Объект.ПричинаПоломки=Перечисления.смартПричиныПоломки.PrintQuality Тогда
		Элементы.Чернила.Видимость=Истина;
	Иначе
		Элементы.Чернила.Видимость=Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи) 
	Если НЕ ЭтаФорма.ВладелецФормы=Неопределено	Тогда
		ЭтаФорма.ВладелецФормы.ОтчетМимаки=Объект.Ссылка; 
		СтруктураПрефиксНомер = смартОбщегоНазначения.РазбитьСтрокуНаПрефиксИНомер(Объект.Код);
		ЭтаФорма.ВладелецФормы.ВнешнийНомер 	= СтруктураПрефиксНомер.Номер;
		ЭтаФорма.ВладелецФормы.Элементы.ВнешнийНомер.ТолькоПросмотр=Истина;
	КонецЕсли;	
КонецПроцедуры 

&НаКлиенте
Процедура ПричинаПоломкиПриИзменении(Элемент)
	Если Объект.ПричинаПоломки=ПредопределенноеЗначение("Перечисление.смартПричиныПоломки.HeadNozzle") 
		ИЛИ Объект.ПричинаПоломки=ПредопределенноеЗначение("Перечисление.смартПричиныПоломки.PrintQuality") Тогда
		Элементы.Чернила.Видимость=Истина;
	Иначе
		Элементы.Чернила.Видимость=Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если (Объект.ПричинаПоломки=ПредопределенноеЗначение("Перечисление.смартПричиныПоломки.HeadNozzle") 
		ИЛИ Объект.ПричинаПоломки=ПредопределенноеЗначение("Перечисление.смартПричиныПоломки.PrintQuality")) И Объект.Чернила.Количество()=0 Тогда
		Сообщить("Необходимо заполнить чернила!");
		Отказ=Истина;
		Возврат;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.Ссылка.Пустая() Тогда	
		Объект.Оборудование=ЭтаФорма.ВладелецФормы.Объект.Оборудование;
		Объект.Серия=ЭтаФорма.ВладелецФормы.Объект.Серия;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВыборФотоОборудования(Команда)
	Оповещение = Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтаФорма,Новый Структура("ТекстНаименования,ИмяРеквизита","Фото оборудования","ФотоОборудования"));
	ПараметрыВыбораФайла=Новый Структура;
	ПараметрыВыбораФайла.Вставить("МаксимальныйРазмер" , 0);
	ПараметрыВыбораФайла.Вставить("НеОткрыватьКарточку", Истина);
	ПараметрыВыбораФайла.Вставить("ФильтрДиалогаВыбора",  НСтр("ru = '(*.jpg)|*.jpg'"));
	РаботаСФайламиКлиент.ДобавитьФайл(Оповещение,ПолучитьСсылкуНаДокументОснование(),ЭтаФорма,2,ПараметрыВыбораФайла);
КонецПроцедуры 

&НаКлиенте
Процедура ВыборФотоШильдаОборудования(Команда)
	Оповещение = Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтаФорма,Новый Структура("ТекстНаименования,ИмяРеквизита","Фото шильда оборудования","ФотоШильдаОборудования"));
	ПараметрыВыбораФайла=Новый Структура;
	ПараметрыВыбораФайла.Вставить("МаксимальныйРазмер" , 0);
	ПараметрыВыбораФайла.Вставить("НеОткрыватьКарточку", Истина);
	ПараметрыВыбораФайла.Вставить("ФильтрДиалогаВыбора",  НСтр("ru = '(*.jpg)|*.jpg'"));
	РаботаСФайламиКлиент.ДобавитьФайл(Оповещение,ПолучитьСсылкуНаДокументОснование(),ЭтаФорма,2,ПараметрыВыбораФайла);
КонецПроцедуры 

&НаКлиенте
Процедура ВыборParametersДоИнсталяции(Команда)
	Оповещение = Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтаФорма,Новый Структура("ТекстНаименования,ИмяРеквизита","Parameters до инсталяции","ParametersДоИнсталяции"));
	ПараметрыВыбораФайла=Новый Структура;
	ПараметрыВыбораФайла.Вставить("МаксимальныйРазмер" , 0.35);
	ПараметрыВыбораФайла.Вставить("НеОткрыватьКарточку", Истина);
	ПараметрыВыбораФайла.Вставить("ФильтрДиалогаВыбора",  НСтр("ru = '(*.csv)|*.csv'"));
	РаботаСФайламиКлиент.ДобавитьФайл(Оповещение,ПолучитьСсылкуНаДокументОснование(),ЭтаФорма,2,ПараметрыВыбораФайла);
КонецПроцедуры 

&НаКлиенте
Процедура ВыборParametersПослеИнсталяции(Команда)
	Оповещение = Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтаФорма,Новый Структура("ТекстНаименования,ИмяРеквизита","Parameters после инсталяции","ParametersПослеИнсталяции"));
	ПараметрыВыбораФайла=Новый Структура;
	ПараметрыВыбораФайла.Вставить("МаксимальныйРазмер" , 0.35);
	ПараметрыВыбораФайла.Вставить("НеОткрыватьКарточку", Истина);
	ПараметрыВыбораФайла.Вставить("ФильтрДиалогаВыбора",  НСтр("ru = '(*.csv)|*.csv'"));
	РаботаСФайламиКлиент.ДобавитьФайл(Оповещение,ПолучитьСсылкуНаДокументОснование(),ЭтаФорма,2,ПараметрыВыбораФайла);
КонецПроцедуры

&НаКлиенте
Процедура ВыборLogДоИнсталяции(Команда)
	Оповещение = Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтаФорма,Новый Структура("ТекстНаименования,ИмяРеквизита","Log до инсталяции","LogДоИнсталяции"));
	ПараметрыВыбораФайла=Новый Структура;
	ПараметрыВыбораФайла.Вставить("МаксимальныйРазмер" , 0);
	//++ #Б-2076 смарт: Лопато 21.02.2025 //Отчет по гарантии Мимаки (смарт)  
	ПараметрыВыбораФайла.Вставить("МинимальныйРазмер", 0.6);
	//-- #Б-2076 смарт: Лопато 21.02.2025
	ПараметрыВыбораФайла.Вставить("НеОткрыватьКарточку", Истина);
	ПараметрыВыбораФайла.Вставить("ФильтрДиалогаВыбора",  НСтр("ru = '(*.csv)|*.csv'"));
	РаботаСФайламиКлиент.ДобавитьФайл(Оповещение,ПолучитьСсылкуНаДокументОснование(),ЭтаФорма,2,ПараметрыВыбораФайла);
КонецПроцедуры 

&НаКлиенте
Процедура ВыборLogПослеИнсталяции(Команда)
	Оповещение = Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтаФорма,Новый Структура("ТекстНаименования,ИмяРеквизита","Log после инсталяции","LogПослеИнсталяции"));
	ПараметрыВыбораФайла=Новый Структура;
	ПараметрыВыбораФайла.Вставить("МаксимальныйРазмер" , 0);
	//++ #Б-2076 смарт: Лопато 21.02.2025 //Отчет по гарантии Мимаки (смарт)  
	ПараметрыВыбораФайла.Вставить("МинимальныйРазмер", 0.6);
	//-- #Б-2076 смарт: Лопато 21.02.2025
	ПараметрыВыбораФайла.Вставить("НеОткрыватьКарточку", Истина);
	ПараметрыВыбораФайла.Вставить("ФильтрДиалогаВыбора",  НСтр("ru = '(*.csv)|*.csv'"));
	РаботаСФайламиКлиент.ДобавитьФайл(Оповещение,ПолучитьСсылкуНаДокументОснование(),ЭтаФорма,2,ПараметрыВыбораФайла);
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаЗавершение(ПараметрыФайла, ДополнительныеПараметры) Экспорт  
	Если НЕ ПараметрыФайла=Неопределено Тогда
		Если ПараметрыФайла.ФайлДобавлен Тогда
			ДополнитьИнформациюВФайл(ДополнительныеПараметры,ПараметрыФайла.ФайлСсылка);
			Объект[ДополнительныеПараметры.ИмяРеквизита]=ПараметрыФайла.ФайлСсылка;  
		ИначеЕсли ПараметрыФайла.ТекстОшибки<>"" Тогда	
			Сообщить(ПараметрыФайла.ТекстОшибки);
		КонецЕсли;	
	Иначе
		Сообщить("Файл не выбран!");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуНаДокументОснование()
	Возврат  ЭтаФорма.Объект.ДокументОснование.Ссылка;
КонецФункции

&НаСервере
Процедура ДополнитьИнформациюВФайл(ДополнительныеПараметры,Файл)
	Об=Файл.ПолучитьОбъект();
	Об.Наименование=ДополнительныеПараметры.ТекстНаименования+" - "+Об.Наименование;
	Об.ОбменДанными.Загрузка=Истина;
	Об.Записать();
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если НЕ ЗначениеЗаполнено(Объект.ФотоОборудования) 
		ИЛИ НЕ ЗначениеЗаполнено(Объект.ФотоШильдаОборудования) 
		ИЛИ НЕ ЗначениеЗаполнено(Объект.ParametersПослеИнсталяции) Тогда
		Отказ=Истина;	
	КонецЕсли;	
	Если НЕ Лев(Объект.Серия.Номер,2)="CG" Тогда
		Если НЕ ЗначениеЗаполнено(Объект.LogПослеИнсталяции) Тогда
			Отказ=Истина;	
		КонецЕсли;
	КонецЕсли;
	Если Отказ Тогда
		Сообщить("Не заполнены файлы!");	
	КонецЕсли;	
КонецПроцедуры
